MCUdude/MajorCore/avr/boards.txt
8515.menu.clock.20MHz_external=External 20 MHz
8515.menu.clock.20MHz_external.upload.default_speed=115200
8515.menu.clock.20MHz_external.bootloader.sut_cksel_bits=111111
8515.menu.clock.20MHz_external.bootloader.ckopt_bit=0
8515.menu.clock.20MHz_external.build.f_cpu=20000000L

8515.menu.clock.18_432MHz_external=External 18.432 MHz
8515.menu.clock.18_432MHz_external.upload.default_speed=115200
8515.menu.clock.18_432MHz_external.bootloader.sut_cksel_bits=111111
8515.menu.clock.18_432MHz_external.bootloader.ckopt_bit=0
8515.menu.clock.18_432MHz_external.build.f_cpu=18432000L

8515.menu.clock.14_7456MHz_external=External 14.7456 MHz
8515.menu.clock.14_7456MHz_external.upload.default_speed=115200
8515.menu.clock.14_7456MHz_external.bootloader.sut_cksel_bits=111111
8515.menu.clock.14_7456MHz_external.bootloader.ckopt_bit=0
8515.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

8515.menu.clock.12MHz_external=External 12 MHz
8515.menu.clock.12MHz_external.upload.default_speed=57600
8515.menu.clock.12MHz_external.bootloader.sut_cksel_bits=111111
8515.menu.clock.12MHz_external.bootloader.ckopt_bit=0
8515.menu.clock.12MHz_external.build.f_cpu=12000000L

8515.menu.clock.11_0592MHz_external=External 11.0592 MHz
8515.menu.clock.11_0592MHz_external.upload.default_speed=115200
8515.menu.clock.11_0592MHz_external.bootloader.sut_cksel_bits=111111
8515.menu.clock.11_0592MHz_external.bootloader.ckopt_bit=0
8515.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

8515.menu.clock.9_216MHz_external=External 9.216 MHz
8515.menu.clock.9_216MHz_external.upload.default_speed=115200
8515.menu.clock.9_216MHz_external.bootloader.sut_cksel_bits=111111
8515.menu.clock.9_216MHz_external.bootloader.ckopt_bit=0
8515.menu.clock.9_216MHz_external.build.f_cpu=9216000L

8515.menu.clock.8MHz_external=External 8 MHz
8515.menu.clock.8MHz_external.upload.default_speed=57600
8515.menu.clock.8MHz_external.bootloader.sut_cksel_bits=111111
8515.menu.clock.8MHz_external.bootloader.ckopt_bit=0
8515.menu.clock.8MHz_external.build.f_cpu=8000000L

8515.menu.clock.7_3728MHz_external=External 7.3728 MHz
8515.menu.clock.7_3728MHz_external.upload.default_speed=115200
8515.menu.clock.7_3728MHz_external.bootloader.sut_cksel_bits=111111
8515.menu.clock.7_3728MHz_external.bootloader.ckopt_bit=0
8515.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

8515.menu.clock.6MHz_external=External 6 MHz
8515.menu.clock.6MHz_external.upload.default_speed=57600
8515.menu.clock.6MHz_external.bootloader.sut_cksel_bits=111111
8515.menu.clock.6MHz_external.bootloader.ckopt_bit=0
8515.menu.clock.6MHz_external.build.f_cpu=6000000L

8515.menu.clock.4MHz_external=External 4 MHz
8515.menu.clock.4MHz_external.upload.default_speed=9600
8515.menu.clock.4MHz_external.bootloader.sut_cksel_bits=111111
8515.menu.clock.4MHz_external.bootloader.ckopt_bit=0
8515.menu.clock.4MHz_external.build.f_cpu=4000000L

8515.menu.clock.3_6864MHz_external=External 3.6864 MHz
8515.menu.clock.3_6864MHz_external.upload.default_speed=115200
8515.menu.clock.3_6864MHz_external.bootloader.sut_cksel_bits=111111
8515.menu.clock.3_6864MHz_external.bootloader.ckopt_bit=0
8515.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

8515.menu.clock.2MHz_external=External 2 MHz
8515.menu.clock.2MHz_external.upload.default_speed=9600
8515.menu.clock.2MHz_external.bootloader.sut_cksel_bits=111111
8515.menu.clock.2MHz_external.bootloader.ckopt_bit=0
8515.menu.clock.2MHz_external.build.f_cpu=2000000L

8515.menu.clock.1_8432MHz_external=External 1.8432 MHz
8515.menu.clock.1_8432MHz_external.upload.default_speed=115200
8515.menu.clock.1_8432MHz_external.bootloader.sut_cksel_bits=111111
8515.menu.clock.1_8432MHz_external.bootloader.ckopt_bit=0
8515.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

8515.menu.clock.1MHz_external=External 1 MHz
8515.menu.clock.1MHz_external.upload.default_speed=9600
8515.menu.clock.1MHz_external.bootloader.sut_cksel_bits=111111
8515.menu.clock.1MHz_external.bootloader.ckopt_bit=0
8515.menu.clock.1MHz_external.build.f_cpu=1000000L

8515.menu.clock.8MHz_internal=Internal 8 MHz
8515.menu.clock.8MHz_internal.upload.default_speed=38400
8515.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
8515.menu.clock.8MHz_internal.bootloader.ckopt_bit=1
8515.menu.clock.8MHz_internal.build.f_cpu=8000000L

8515.menu.clock.4MHz_internal=Internal 4 MHz
8515.menu.clock.4MHz_internal.upload.default_speed=9600
8515.menu.clock.4MHz_internal.bootloader.sut_cksel_bits=100011
8515.menu.clock.4MHz_internal.bootloader.ckopt_bit=1
8515.menu.clock.4MHz_internal.build.f_cpu=4000000L

8515.menu.clock.2MHz_internal=Internal 2 MHz
8515.menu.clock.2MHz_internal.upload.default_speed=9600
8515.menu.clock.2MHz_internal.bootloader.sut_cksel_bits=100010
8515.menu.clock.2MHz_internal.bootloader.ckopt_bit=1
8515.menu.clock.2MHz_internal.build.f_cpu=2000000L

8515.menu.clock.1MHz_internal=Internal 1 MHz
8515.menu.clock.1MHz_internal.upload.default_speed=9600
8515.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
8515.menu.clock.1MHz_internal.bootloader.ckopt_bit=1
8515.menu.clock.1MHz_internal.build.f_cpu=1000000L
